OliverSwift/TFT28-105-STM32WB55/STM32_WPAN/App/ancs_client_app.c
/**
 ******************************************************************************
 * @file    ancs_client_app.c
 * @author  MCD Application Team
 * @brief   ANCS client Application
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2018 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under Ultimate Liberty license
 * SLA0044, the "License"; You may not use this file except in compliance with
 * the License. You may obtain a copy of the License at:
 *                             www.st.com/SLA0044
 *
 ******************************************************************************
 */


/* Includes ------------------------------------------------------------------*/
#include "app_common.h"
#include "dbg_trace.h"

#include "ble.h"
#include "app_ble.h"    
#include "ancs_client_app.h"

#include "stm32_seq.h"
#include "app.h"
#include "main.h"

/* Private defines -----------------------------------------------------------*/

/* MAX Number of entry in the context lists */
#define MAX_NMB_NOTIFY         128
#define MAX_DISPLAY_NAME_LEN   128
#define MAX_DATA_LIST_LEN      0xFF
#define MAX_DATA_LEN           0x0128

static ANCS_Notification lastNotification;

/**
 * The default GATT command timeout is set to 30s
 */
#define GATT_DEFAULT_TIMEOUT (30000)


/* Invalid Notify Entry */
#define INVALID_NOTIFY_ENTRY   0xFFFF

#define UNPACK_2_BYTE_PARAMETER(ptr)  \
		(uint16_t)((uint16_t)(*((uint8_t *)ptr))) |   \
		(uint16_t)((((uint16_t)(*((uint8_t *)ptr + 1))) << 8))

/* copy UUID to tab */
#define COPY_UUID_128(uuid_struct, uuid_15, uuid_14, uuid_13, uuid_12, uuid_11, uuid_10, uuid_9, uuid_8, uuid_7, uuid_6, uuid_5, uuid_4, uuid_3, uuid_2, uuid_1, uuid_0) \
		do {\
			uuid_struct[0] = uuid_0; uuid_struct[1] = uuid_1; uuid_struct[2] = uuid_2; uuid_struct[3] = uuid_3; \
			uuid_struct[4] = uuid_4; uuid_struct[5] = uuid_5; uuid_struct[6] = uuid_6; uuid_struct[7] = uuid_7; \
			uuid_struct[8] = uuid_8; uuid_struct[9] = uuid_9; uuid_struct[10] = uuid_10; uuid_struct[11] = uuid_11; \
			uuid_struct[12] = uuid_12; uuid_struct[13] = uuid_13; uuid_struct[14] = uuid_14; uuid_struct[15] = uuid_15; \
		}while(0)

/* UUIDs list for ANCS service and characteristics*/
#define COPY_ANCS_SERVICE_UUID(uuid_struct)                      COPY_UUID_128(uuid_struct, 0x79, 0x05, 0xF4, 0x31, 0xB5, 0xCE, 0x4E, 0x99, 0xA4, 0x0F, 0x4B, 0x1E, 0x12, 0x2D, 0x00, 0xD0)
#define COPY_ANCS_NOTIFICATION_SOURCE_UUID(uuid_struct)          COPY_UUID_128(uuid_struct, 0x9F, 0xBF, 0x12, 0x0D, 0x63, 0x01, 0x42, 0xD9, 0x8C, 0x58, 0x25, 0xE6, 0x99, 0xA2, 0x1D, 0xBD)
#define COPY_ANCS_DATA_SOURCE_UUID(uuid_struct)                  COPY_UUID_128(uuid_struct, 0x22, 0xEA, 0xC6, 0xE9, 0x24, 0xD6, 0x4B, 0xB5, 0xBE, 0x44, 0xB3, 0x6A, 0xCE, 0x7C, 0x7B, 0xFB)
#define COPY_ANCS_CONTROL_POINT_UUID(uuid_struct)                COPY_UUID_128(uuid_struct, 0x69, 0xD1, 0xD8, 0xF3, 0x45, 0xE1, 0x49, 0xA8, 0x98, 0x21, 0x9B, 0xBD, 0xFD, 0xAA, 0xD9, 0xD9)

/* Private typedef -----------------------------------------------------------*/
typedef enum
{
	GATT_PROC_MTU_UPDATE,
	GATT_PROC_DISC_ANCS_SERVICE,
	GATT_PROC_DISC_ALL_PRIMARY_SERVICES,
	GATT_PROC_DISC_ALL_CHARS,
	GATT_PROC_DISC_ALL_DESCS,
	GATT_PROC_ENABLE_ALL_NOTIFICATIONS,
} GattProcId_t;

typedef enum
{
	ANCS_PROC_GET_NOTIFICATION_ATTRIBUTE,
	ANCS_PROC_GET_APP_ATTRIBUTE,
	ANCS_PROC_PERFORM_NOTIFICATION_ACTION,
} AncsProcId_t;

/**
 * structure of fields for GATT notication source characteristic
 */
typedef struct notifyListS {
	uint8_t    used;           /*flag to indicate notification processed or not*/
	EventID    evID;
	EventFlags evFlag;
	CategoryID catID;
	uint8_t    catCount;
	uint32_t   notifUID;
} notifyList_type;

/**
 * structure of ANCS context (containing all needed settings: events state, handlers, inputs...)
 */
typedef struct ancs_contextS {

	ANCS_ProfileState state;
	uint16_t connection_handle;

	uint8_t appDisplayName_len;
	uint8_t appDisplayName[MAX_DISPLAY_NAME_LEN];
	uint8_t AppIdentifierLength;
	uint8_t AppIdentifier[MAX_DISPLAY_NAME_LEN];
	uint8_t list[MAX_DATA_LIST_LEN];

	notifyList_type notifyList[MAX_NMB_NOTIFY];

	uint16_t notifyEntry; /* index of input notification */
	uint8_t notifyShowed; /* flag to indicate notification has already been displayed */
	uint32_t startTime;
	uint8_t genericFlag;  /* action done after notification */

	uint16_t ALLServiceStartHandle;
	uint16_t ALLServiceEndHandle;

	uint16_t GAPServiceStartHandle;
	uint16_t GAPServiceEndHandle;

	uint16_t GAPCentralAddressResolutionCharStartHdle;
	uint16_t GAPCentralAddressResolutionCharValueHdle;
	uint16_t GAPCentralAddressResolutionCharDescHdle;
	uint16_t GAPCentralAddressResolutionCharEndHdle;

	uint16_t GATTServiceStartHandle;
	uint16_t GATTServiceEndHandle;

	uint16_t ServiceChangedCharStartHdle;
	uint16_t ServiceChangedCharValueHdle;
	uint16_t ServiceChangedCharDescHdle;
	uint16_t ServiceChangedCharEndHdle;

	uint16_t ANCSServiceStartHandle;
	uint16_t ANCSServiceEndHandle;

	uint16_t ANCSNotificationSourceCharStartHdle;
	uint16_t ANCSControlPointCharStartHdle;
	uint16_t ANCSDataSourceCharStartHdle;

	uint16_t ANCSNotificationSourceCharValueHdle;
	uint16_t ANCSControlPointCharValueHdle;
	uint16_t ANCSDataSourceCharValueHdle;

	uint16_t ANCSNotificationSourceCharDescHdle;
	uint16_t ANCSControlPointCharDescHdle;
	uint16_t ANCSDataSourceCharDescHdle;

} ancs_context_type;

/* Private macros ------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
PLACE_IN_SECTION("BLE_APP_CONTEXT") static ancs_context_type ancs_context;

/* Global variables ----------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/
static void gatt_cmd_resp_wait(uint32_t timeout);
static void gatt_cmd_resp_release(uint32_t flag);
static void GattProcReq(GattProcId_t GattProcId);
static void GattParseServicesByUUID(aci_att_find_by_type_value_resp_event_rp0 *pr);
static void GattParseServices(aci_att_read_by_group_type_resp_event_rp0 *pr);
static void GattParseChars(aci_att_read_by_type_resp_event_rp0 *pr);
static void GattParseDescs(aci_att_find_info_resp_event_rp0 *pr);
static void GattParseNotification(aci_gatt_notification_event_rp0 *pr);

static void ANCS_App_Update_Service( void );
static SVCCTL_EvtAckStatus_t ANCS_Client_Event_Handler( void *Event );

void ANCS_Notification_Check(EventFlags EventFlagMask);
void ANCS_Client_Reset( void );
static void AncsProcReq(AncsProcId_t AncsProcId);
static void Ancs_Mgr( void );

/* Functions Definition ------------------------------------------------------*/
/* Private functions ----------------------------------------------------------*/
/**
 * Display Event ID notified in ANCS notification source characteristic
 */
static void ANCS_Show_EventID(EventID evID)
{
	switch(evID) {
	case EventIDNotificationAdded:
		printf("** EventID: Added\r\n");
		break;
	case EventIDNotificationModified:
		printf("** EventID: Modified\r\n");
		break;
	case EventIDNotificationRemoved:
		printf("** EventID: Removed\r\n");
		break;
	}
}

/**
 * Display Event Flag notified in ANCS notification source characteristic
 */
static void ANCS_Show_EventFlag(EventFlags evFlag)
{
	printf("** EventFlags:");
	if (evFlag & EventFlagSilent) 			printf(" Silent");
	if (evFlag & EventFlagImportant) 		printf(" Important");
	if (evFlag & EventFlagPreExisting) 		printf(" PreExisting");
	if (evFlag & EventFlagPositiveAction) 	printf(" PositiveAction");
	if (evFlag & EventFlagNegativeAction) 	printf(" NegativeAction");
	printf("\n");
}

/**
 * Display CategoryID notified in ANCS notification source characteristic
 */
static void ANCS_Show_CategoryID(CategoryID catID)
{
	switch (catID) {
	case CategoryIDOther:
		printf("** CategoryID: Other\r\n");
		break;
	case CategoryIDIncomingCall:
		printf("** CategoryID: Incoming Call\r\n");
		break;
	case CategoryIDMissedCall:
		printf("** CategoryID: Missed Call\r\n");
		break;
	case CategoryIDVoicemail:
		printf("** CategoryID: Voice Mail\r\n");
		break;
	case CategoryIDSocial:
		printf("** CategoryID: Social\r\n");
		break;
	case CategoryIDSchedule:
		printf("** CategoryID: Schedule\r\n");
		break;
	case CategoryIDEmail:
		printf("** CategoryID: Email\r\n");
		break;
	case CategoryIDNews:
		printf("** CategoryID: News\r\n");
		break;
	case CategoryIDHealthAndFitness:
		printf("** CategoryID: Healt and Fitness\r\n");
		break;
	case CategoryIDBusinessAndFinance:
		printf("** CategoryID: Business and Finance\r\n");
		break;
	case CategoryIDLocation:
		printf("** CategoryID: Location\r\n");
		break;
	case CategoryIDEntertainment:
		printf("** CategoryID: Entertainment\r\n");
		break;
	default:
		printf("** CategoryID: Reserved(%d)\r\n", catID);
		break;
	}
}

/**
 * Display Notification AttributeID for Get Notification Attributes command from NC
 */
static void ANCS_Show_Attr(NotificationAttributeID attrID)
{
	switch (attrID) {
	case NotificationAttributeIDAppIdentifier:
		printf("** AppIdentifier: ");
		break;
	case NotificationAttributeIDTitle:
		printf("** Title: ");
		break;
	case NotificationAttributeIDSubtitle:
		printf("** SubTitle: ");
		break;
	case NotificationAttributeIDMessage:
		printf("** Message: ");
		break;
	case NotificationAttributeIDMessageSize:
		printf("** MessageSize: ");
		break;
	case NotificationAttributeIDDate:
		printf("** Date: ");
		break;
	case NotificationAttributeIDPositiveActionLabel:
		printf("** PositiveActionLabel: ");
		break;
	case NotificationAttributeIDNegativeActionLabel:
		printf("** NegativeActionLabel: ");
		break;
	}
}

/**
 * Display App AttributeID used in Get App Attributes command from NC
 */
static void ANCS_Show_AppAttr(AppAttributeID appAttrID)
{
	printf("\r\n*************** App Attribute Infomation Received **********************\r\n");
	switch (appAttrID) {
	case AppAttributeIDDisplayName:
		printf("** DisplayName: ");
		break;
	}
}

/**
 * Display different fields for GATT notication source characteristic received
 */
static void ANCS_Show_Notification(uint16_t index)
{
	printf("\r\n*************** Data Source Detailed Information Received **********************\r\n");
	ANCS_Show_EventID((EventID)ancs_context.notifyList[index].evID);
	ANCS_Show_EventFlag((EventFlags)ancs_context.notifyList[index].evFlag);
	ANCS_Show_CategoryID((CategoryID)ancs_context.notifyList[index].catID);
	printf("** CategoryCount: %d\r\n", ancs_context.notifyList[index].catCount);
	printf("** NotificationUID: 0x%08x\r\n", (int)ancs_context.notifyList[index].notifUID);
}

/**
 * create Get Notification Attributes command to NP from UID notification and action flags inputs
 */
static void ANCS_Cmd_GetNotificationAttr(notificationAttr_type attr)
{
	tBleStatus result = BLE_STATUS_SUCCESS;
	uint8_t CmdSize = 5;
	uint8_t CmdGetNotificationAtt[19]={CommandIDGetNotificationAttributes,
			(uint8_t)(attr.UID >> 0),
			(uint8_t)(attr.UID >> 8),
			(uint8_t)(attr.UID >> 16),
			(uint8_t)(attr.UID >> 24),
	};

	if (attr.appID_flag == TRUE)
	{
		CmdGetNotificationAtt[CmdSize++] = NotificationAttributeIDAppIdentifier;
	}

	if ( (attr.title_flag == TRUE) && (attr.title_max_size != 0x00) )
	{
		CmdGetNotificationAtt[CmdSize++] = NotificationAttributeIDTitle;
		CmdGetNotificationAtt[CmdSize++] = (uint8_t)((attr.title_max_size >> 0) & 0xFF);
		CmdGetNotificationAtt[CmdSize++] = (uint8_t)((attr.title_max_size >> 8) & 0xFF);
	}

	if ( (attr.subtitle_flag == TRUE) && (attr.subtitle_max_size!= 0x00) )
	{
		CmdGetNotificationAtt[CmdSize++] = NotificationAttributeIDSubtitle;
		CmdGetNotificationAtt[CmdSize++] = (uint8_t)((attr.subtitle_max_size >> 0) & 0xFF);
		CmdGetNotificationAtt[CmdSize++] = (uint8_t)((attr.subtitle_max_size >> 8) & 0xFF);
	}

	if ( (attr.message_flag == TRUE) && (attr.message_max_size != 0x00) )
	{
		CmdGetNotificationAtt[CmdSize++] = NotificationAttributeIDMessage;
		CmdGetNotificationAtt[CmdSize++] = (uint8_t)((attr.message_max_size >> 0) & 0xFF);
		CmdGetNotificationAtt[CmdSize++] = (uint8_t)((attr.message_max_size >> 8) & 0xFF);
	}

	if (attr.messageSize_flag == TRUE)
	{
		CmdGetNotificationAtt[CmdSize++] = NotificationAttributeIDMessageSize;
	}

	if (attr.date_flag == TRUE)
	{
		CmdGetNotificationAtt[CmdSize++] = NotificationAttributeIDDate;
	}

	if (attr.positiveAction_flag == TRUE)
	{
		CmdGetNotificationAtt[CmdSize++] = NotificationAttributeIDPositiveActionLabel;
	}

