OliverSwift/TFT28-105-STM32WB55/STM32_WPAN/App/ancs_client_app.c
	if (attr.negativeAction_flag == TRUE)
	{
		CmdGetNotificationAtt[CmdSize++] = NotificationAttributeIDNegativeActionLabel;
	}

	result = aci_gatt_write_char_value( ancs_context.connection_handle,
			ancs_context.ANCSControlPointCharValueHdle,
			CmdSize,
			(uint8_t *)CmdGetNotificationAtt);
	gatt_cmd_resp_wait(GATT_DEFAULT_TIMEOUT);
	if (result != BLE_STATUS_SUCCESS)
	{
		APP_DBG_MSG(" aci_gatt_write_char_value cmd NOK status =0x%02X \n",result);
	}

}


/**
 * create Perform Notification Action command from UID notification received and desired action ID
 */
static void ANCS_Cmd_PerformNotificationAction(uint32_t notificationUID, ActionID actID)
{
	tBleStatus result = BLE_STATUS_SUCCESS;
	uint8_t CmdPerformNotificationAction[]={CommandIDPerformNotificationAction,
			(uint8_t)(notificationUID >> 0),
			(uint8_t)(notificationUID >> 8),
			(uint8_t)(notificationUID >> 16),
			(uint8_t)(notificationUID >> 24),
			actID };

	result = aci_gatt_write_char_value(ancs_context.connection_handle,
			ancs_context.ANCSControlPointCharValueHdle,
			sizeof(CmdPerformNotificationAction),
			(uint8_t *)CmdPerformNotificationAction);
	gatt_cmd_resp_wait(GATT_DEFAULT_TIMEOUT);
	if (result != BLE_STATUS_SUCCESS)
	{
		APP_DBG_MSG(" aci_gatt_write_char_value cmd NOK status =0x%02X \n",result);
	}
}

/**
 * create Get App Attributes command to NP for number of wanted AppIdentifiers input
 */
static void ANCS_Cmd_GetAppAttr(uint8_t AppIdentifierLength, char *AppIdentifier/* NULL Terminated*/)
{
	tBleStatus result = BLE_STATUS_SUCCESS;
	uint8_t CmdSize = 0;
	uint8_t CmdGetAppAtt[128]={0};

	CmdGetAppAtt[CmdSize++] = CommandIDGetAppAttributes;

	// Append null terminated app identifier string
	while(*AppIdentifier) {
		CmdGetAppAtt[CmdSize++] = *AppIdentifier++;
	}
	CmdGetAppAtt[CmdSize++] = 0;

	// Attributes we want (only DisplayName since it's the only existing one ATM)
	CmdGetAppAtt[CmdSize++] = AppAttributeIDDisplayName;

	result = aci_gatt_write_char_value( ancs_context.connection_handle,
			ancs_context.ANCSControlPointCharValueHdle,
			CmdSize,
			(uint8_t *)CmdGetAppAtt);
	gatt_cmd_resp_wait(GATT_DEFAULT_TIMEOUT);
	if (result != BLE_STATUS_SUCCESS)
	{
		APP_DBG_MSG(" aci_gatt_write_char_value cmd NOK status =0x%02X \n",result);
	}
}

/**
 * Called by application when user interacts on corresponding notification
 */
static void notificationYesNoCallback(uint32_t notifUID, ActionID actID) {
	lastNotification.notifUID = notifUID;
	lastNotification.actID = actID;
	ancs_context.state = ANCS_PERFORM_NOTIFICATION_ACTION;
	Ancs_Mgr();
}

/**
 * Parser of response for Get Notification Attributes command
 * number of received attributes and attributes list input
 */
static void ANCS_Parse_GetNotificationAttr_Resp(uint32_t  notifUID, uint16_t attrLen, uint8_t  *attrList)
{
	uint16_t len, index;

	// Clear last Notification information
	memset(&lastNotification, 0, sizeof(lastNotification));
	lastNotification.notifUID = notifUID;
	lastNotification.categoryId = ancs_context.notifyList[ancs_context.notifyEntry].catID;
	lastNotification.cb = notificationYesNoCallback;

	/* loop on number of attribute IDs */
	index = 0;

	while (index < attrLen)
	{
		/* attrList[index+0] corresponding to AttributeID x*/
		Osal_MemCpy(&len, &attrList[index+1], 2); /* AttributeID x Value Length */
		if (len == 0)  /* Empty */
		{
			index += 3;
		}
		else
		{
			/* AttributeID x */
			NotificationAttributeID attrID = (NotificationAttributeID)attrList[index];

			ANCS_Show_Attr(attrID); /* Notification AttributeID x*/

			/* AttributeID x Value */
			index++;
			if (len <= sizeof(ancs_context.list))
			{
				Osal_MemCpy(ancs_context.list, &attrList[index+2], len);
				ancs_context.list[len] = '\0';
			}
			else
			{
				Osal_MemCpy(ancs_context.list, &attrList[index+2], sizeof(ancs_context.list)-1);
				ancs_context.list[sizeof(ancs_context.list)-1] = '\0';
			}

			if (len > 0) {
				printf(" %s\r\n", ancs_context.list);
				switch(attrID) {
				case NotificationAttributeIDMessage:
					strncpy(lastNotification.message, (char*)ancs_context.list, MESSAGE_SIZE-1);
					break;
				case NotificationAttributeIDTitle:
					strncpy(lastNotification.title, (char*)ancs_context.list, TITLE_SIZE-1);
					break;
				default:
					break;
				}
			}

			index += 2 + len; /* 2 Bytes Length of AttributeID x Value + Value Length*/
		}
	}// while

	if (!ancs_context.notifyShowed) {
		ANCS_Show_Notification(ancs_context.notifyEntry);
		ancs_context.notifyShowed = TRUE;
		ancs_context.state = ANCS_NOTIFY_USER; // Tell the application that a notification is ready
		ancs_context.notifyList[ancs_context.notifyEntry].used = FALSE;
	} else {
		ancs_context.state = ANCS_IDLE;
	}
}

/**
 * Parser of response for Get App Attributes command
 * number of received attributes and attributes list input
 */
static void ANCS_Parse_GetAppAttr_Resp(uint8_t  commandID, uint16_t attrLen, uint8_t  *attrList)
{
	uint8_t appId;
	uint16_t len, index;

	index = 0;
	if(commandID == CommandIDGetAppAttributes)
	{
		/* loop on number of attribute IDs */
		while (index < attrLen)
		{
			/* attrList[index+0] corresponding to AttributeID x*/
			Osal_MemCpy(&len, &attrList[index+1], 2); /* AttributeID x Value Length */
			if (len == 0)  /* Empty */
			{
				index += 3;
			}
			else
			{
				/* AttributeID x */
				ANCS_Show_AppAttr((AppAttributeID)attrList[index]); /* App AttributeID x */

				/* AttributeID for Application identifier */
				if (attrList[index] == AppAttributeIDDisplayName)
				{
					appId = TRUE;
				} else {
					appId = FALSE;
				}

				/* AttributeID x Value */
				index++;
				if (len <= sizeof(ancs_context.list))
				{
					Osal_MemCpy(ancs_context.list, &attrList[index+2], len);
					ancs_context.list[len] = '\0';
				}
				else
				{
					Osal_MemCpy(ancs_context.list, &attrList[index+2], sizeof(ancs_context.list)-1);
					ancs_context.list[sizeof(ancs_context.list)-1] = '\0';
				}

				index += 2 + len; /* 2 Bytes Length of AttributeID x Value + Value Length*/
				if (appId)
				{
					if ((len+1) <= MAX_DISPLAY_NAME_LEN)
					{
						Osal_MemCpy(ancs_context.appDisplayName, ancs_context.list, len+1);
						ancs_context.appDisplayName_len = len + 1;
					} else {
						Osal_MemCpy(ancs_context.appDisplayName, ancs_context.list, MAX_DISPLAY_NAME_LEN);
						ancs_context.appDisplayName_len = MAX_DISPLAY_NAME_LEN;
					}
				} // appId

				if (len > 0)
					printf(" %s\r\n", ancs_context.list);
			}
		}// while
	}// commandID
}
/**
 * Parser of ANCS Notification Source characteristic received
 * to fill ancs_context.notifyList elements
 */
static void ANCS_Notification_Source_Received_event(
		EventID evID,
		EventFlags evFlag,
		CategoryID catID,
		uint8_t catCount,
		uint32_t notifUID)
{
	uint16_t i;

