OliverSwift/TFT28-105-STM32WB55/STM32_WPAN/App/ancs_client_app.c
	printf("*************** Notification Received **********************\r\n");
	ANCS_Show_EventID(evID);
	ANCS_Show_EventFlag(evFlag);
	ANCS_Show_CategoryID(catID);
	printf("** CategoryCount: %d\n", catCount);
	printf("** NotificationUID: 0x%08lx\n", notifUID);

	if (evID == EventIDNotificationRemoved)
	{
		for (i=0; i < MAX_NMB_NOTIFY; i++)
		{
			if (ancs_context.notifyList[i].notifUID == notifUID)
			{
				ancs_context.notifyList[i].used = FALSE;
				printf("** notifyEntry: %d Removed\r\n", i);
				break;
			}
		}
	}
	else
	{
		for (i=0; i < MAX_NMB_NOTIFY; i++)
		{
			if (!ancs_context.notifyList[i].used)
			{
				ancs_context.notifyList[i].used = TRUE;
				ancs_context.notifyList[i].evID = evID;
				ancs_context.notifyList[i].evFlag = evFlag;
				ancs_context.notifyList[i].catID = catID;
				ancs_context.notifyList[i].catCount = catCount;
				ancs_context.notifyList[i].notifUID = notifUID;
				lastNotification.evtId = evID;
				lastNotification.categoryId = catID;
				lastNotification.notifUID = notifUID;
				printf("** notifyEntry: %d Added\r\n", i);
				break;
			}
		}
	}
}

/**
 * check event flag from ANCS Notification Source characteristic received
 * to fill ancs_context and filter silent event flags
 */
void ANCS_Notification_Check(EventFlags EventFlagMask)
{
	ancs_context.notifyEntry = INVALID_NOTIFY_ENTRY;
	for (uint8_t idx=0; idx<MAX_NMB_NOTIFY; idx++)
	{
		if (ancs_context.notifyList[idx].used)
		{
			if((ancs_context.notifyList[idx].evFlag & EventFlagMask))
			{
				ancs_context.notifyEntry = idx;
				ancs_context.notifyShowed = FALSE;
				ancs_context.state = ANCS_GET_NOTIFICATION_ATTRIBUTE;
				break;
			}
		}
	}
	if (ancs_context.notifyEntry == INVALID_NOTIFY_ENTRY)
	{
		APP_DBG_MSG(" ancs_context.notifyEntry == INVALID_NOTIFY_ENTRY => ANCS_IDLE \n");
		ancs_context.state = ANCS_IDLE;
	}
}

/* Public functions ----------------------------------------------------------*/

/****************************************************************/
/*                                                              */
/*                      GATT CLIENT PART                           */
/****************************************************************/
/**
 * Reset all ancs_context fields to default values
 */
void ANCS_Client_Reset( void )
{
	memset(&ancs_context, 0x00, sizeof(ancs_context));

	for (uint8_t i=0; i < MAX_NMB_NOTIFY; i++)
	{
		ancs_context.notifyList[i].used = 0x00;
	}

	ancs_context.state = ANCS_IDLE;
	ancs_context.connection_handle = 0xFFFF;
	ancs_context.notifyEntry = INVALID_NOTIFY_ENTRY;

	APP_DBG_MSG("ANCS CLIENT RESET \n");

	return;
}
/**
 * function used to set task ANCS_App_Update_Service when processed ANCS_Client_Event_Handler
 */
static void Ancs_Mgr( void )
{
	UTIL_SEQ_SetTask(1 << CFG_TASK_APP_ANCS_UPDATE_SERVICE_ID, CFG_SCH_PRIO_0);
	return;
}

/**
 * function of ANCS service and characteristics init
 */
void ANCS_Client_App_Init( void )
{
	/* register ANCS_Client_Event_Handler to BLE Controller initialization*/
	SVCCTL_RegisterCltHandler(ANCS_Client_Event_Handler);

	UTIL_SEQ_RegTask(1<<CFG_TASK_APP_ANCS_UPDATE_SERVICE_ID, UTIL_SEQ_RFU, ANCS_App_Update_Service);

	/* reset ANCS context */
	ANCS_Client_Reset();

	APP_DBG_MSG("-- ANCS CLIENT INITIALIZED \n");

	return;
}

static void gatt_cmd_resp_release(uint32_t flag)
{
	UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_GATT_PROC_COMPLETE);
	return;
}

static void gatt_cmd_resp_wait(uint32_t timeout)
{
	UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_GATT_PROC_COMPLETE);
	return;
}

/**
 * function of GATT service parse by UUID
 */
static void GattParseServicesByUUID(aci_att_find_by_type_value_resp_event_rp0 *pr)
{
	/* complete ancs_context fields */
	if(ancs_context.state == ANCS_DISCOVER_ANCS_SERVICE)
	{
		ancs_context.ANCSServiceStartHandle = pr->Attribute_Group_Handle_Pair[0].Found_Attribute_Handle;
		ancs_context.ANCSServiceEndHandle = pr->Attribute_Group_Handle_Pair[0].Group_End_Handle;
	}
}


/**
 * function of GATT service parse
 */
static void GattParseServices(aci_att_read_by_group_type_resp_event_rp0 *pr)
{
	uint16_t uuid,ServiceStartHandle,ServiceEndHandle;
	uint8_t uuid_offset,uuid_size,uuid_short_offset;
	uint8_t i,idx,numServ;

	/* check connection handle related to response before processing */
	if (ancs_context.connection_handle == pr->Connection_Handle)
	{
		/* Number of attribute value tuples */
		numServ = (pr->Data_Length) / pr->Attribute_Data_Length;

		/* event data in Attribute_Data_List contains:
		 * 2 bytes for start handle
		 * 2 bytes for end handle
		 * 2 or 16 bytes data for UUID
		 */
		if (pr->Attribute_Data_Length == 20) /* we are interested in the UUID is 128 bit.*/
		{
			idx = 16;                /*UUID index of 2 bytes read part in Attribute_Data_List */
			uuid_offset = 4;         /*UUID offset in bytes in Attribute_Data_List */
			uuid_size = 16;          /*UUID size in bytes */
			uuid_short_offset = 12;  /*UUID offset of 2 bytes read part in UUID field*/
		}
		if (pr->Attribute_Data_Length == 6) /* we are interested in the UUID is 16 bit.*/
		{
			idx = 4;
			uuid_offset = 4;
			uuid_size = 2;
			uuid_short_offset = 0;
		}
		UNUSED(idx);
		UNUSED(uuid_size);

		/* Loop on number of attribute value tuples */
		for (i = 0; i < numServ; i++)
		{
			ServiceStartHandle =  UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[uuid_offset - 4]);
			ServiceEndHandle = UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[uuid_offset - 2]);
			uuid = UNPACK_2_BYTE_PARAMETER(&pr->Attribute_Data_List[uuid_offset + uuid_short_offset]);

			/* complete ancs_context fields */
			if ( (ancs_context.ALLServiceStartHandle == 0x0000) || (ServiceStartHandle < ancs_context.ALLServiceStartHandle) )
			{
				ancs_context.ALLServiceStartHandle = ServiceStartHandle;
			}
			if ( (ancs_context.ALLServiceEndHandle== 0x0000) || (ServiceEndHandle > ancs_context.ALLServiceEndHandle) )
			{
				ancs_context.ALLServiceEndHandle = ServiceEndHandle;
			}


			if(uuid == GAP_SERVICE_UUID) /* 0x1800 */ {

				ancs_context.GAPServiceStartHandle = ServiceStartHandle;
				ancs_context.GAPServiceEndHandle = ServiceEndHandle;
			} else if (uuid == GENERIC_ATTRIBUTE_SERVICE_UUID) /* 0x1801 */ {

