OliverSwift/TFT28-105-STM32WB55/STM32_WPAN/App/ancs_client_app.c
				ancs_context.GATTServiceStartHandle = ServiceStartHandle;
				ancs_context.GATTServiceEndHandle = ServiceEndHandle;
			} else if (uuid == ANCS_SERVICE_UUID) {

				ancs_context.ANCSServiceStartHandle = ServiceStartHandle;
				ancs_context.ANCSServiceEndHandle = ServiceEndHandle;
			}

			uuid_offset += pr->Attribute_Data_Length;
		}//numServ
	}
	else
	{
		APP_DBG_MSG("ACI_ATT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE, failed no free index in connection table !\n");
	}
}

/**
 * function of GATT characteristics parse
 */
static void GattParseChars(aci_att_read_by_type_resp_event_rp0 *pr)
{
	uint16_t uuid,CharStartHandle,CharValueHandle;
	uint8_t uuid_offset,uuid_size,uuid_short_offset;
	uint8_t i,idx,numHdleValuePair;
	uint8_t CharProperties;

	if (ancs_context.connection_handle == pr->Connection_Handle)
	{
		/* event data in Attribute_Data_List contains:
		 * 2 bytes for start handle
		 * 1 byte char properties
		 * 2 bytes handle
		 * 2 or 16 bytes data for UUID
		 */

		/* Number of attribute value tuples */
		numHdleValuePair = pr->Data_Length / pr->Handle_Value_Pair_Length;

		if (pr->Handle_Value_Pair_Length == 21) /* we are interested in  128 bit UUIDs */
		{
			idx = 17;                /*UUID index of 2 bytes read part in Attribute_Data_List */
			uuid_offset = 5;         /*UUID offset in bytes in Attribute_Data_List */
			uuid_size = 16;          /*UUID size in bytes */
			uuid_short_offset = 12;  /*UUID offset of 2 bytes read part in UUID field*/
		}
		if (pr->Handle_Value_Pair_Length == 7) /* we are interested in  16 bit UUIDs */
		{
			idx = 5;
			uuid_offset = 5;
			uuid_size = 2;
			uuid_short_offset = 0;
		}
		UNUSED(idx);
		UNUSED(uuid_size);

		pr->Data_Length -= 1;

		/* Loop on number of attribute value tuples */
		for (i = 0; i < numHdleValuePair; i++)
		{
			CharStartHandle = UNPACK_2_BYTE_PARAMETER(&pr->Handle_Value_Pair_Data[uuid_offset-5]);
			CharProperties = pr->Handle_Value_Pair_Data[uuid_offset-3];
			CharValueHandle = UNPACK_2_BYTE_PARAMETER(&pr->Handle_Value_Pair_Data[uuid_offset-2]);
			uuid = UNPACK_2_BYTE_PARAMETER(&pr->Handle_Value_Pair_Data[uuid_offset+uuid_short_offset]);

			if ( (uuid != 0x0) && (CharProperties != 0x0) && (CharStartHandle != 0x0) && (CharValueHandle !=0) )
			{
				/* complete ancs_context fields */
				if (uuid == SERVICE_CHANGED_CHARACTERISTIC_UUID) /* 0x2A05 */ {
					ancs_context.ServiceChangedCharStartHdle = CharStartHandle;
					ancs_context.ServiceChangedCharValueHdle = CharValueHandle;
				} else if (uuid == ANCS_NOTIFICATION_SOURCE_CHAR_UUID) {

					ancs_context.ANCSNotificationSourceCharStartHdle = CharStartHandle;
					ancs_context.ANCSNotificationSourceCharValueHdle = CharValueHandle;

					APP_DBG_MSG("ANCS_NOTIFICATION_SOURCE_CHAR_UUID=0x%04X found [%04X %04X]!\n",uuid,CharStartHandle,CharValueHandle);
				} else if (uuid == ANCS_CONTROL_POINT_CHAR_UUID) {

					ancs_context.ANCSControlPointCharStartHdle = CharStartHandle;
					ancs_context.ANCSControlPointCharValueHdle = CharValueHandle;

					APP_DBG_MSG("ANCS_CONTROL_POINT_CHAR_UUID=0x%04X found [%04X %04X]!\n",uuid,CharStartHandle,CharValueHandle);
				} else if (uuid == ANCS_DATA_SOURCE_CHAR_UUID) {

					ancs_context.ANCSDataSourceCharStartHdle = CharStartHandle;
					ancs_context.ANCSDataSourceCharValueHdle = CharValueHandle;

					APP_DBG_MSG("ANCS_DATA_SOURCE_CHAR_UUID=0x%04X found [%04X %04X]!\n",uuid,CharStartHandle,CharValueHandle);

				} else if (uuid == CENTRAL_ADDRESS_RESOLUTION_UUID) {

					ancs_context.GAPCentralAddressResolutionCharStartHdle = CharStartHandle;
					ancs_context.GAPCentralAddressResolutionCharValueHdle = CharValueHandle;
				}

			}
			uuid_offset += pr->Handle_Value_Pair_Length;
		}// numHdleValuePair
	}
	else
		APP_DBG_MSG("ACI_ATT_READ_BY_TYPE_RESP_VSEVT_CODE, failed handle not found in connection table !\n");
}

/**
 * function of GATT descriptor parse
 */
static void GattParseDescs(aci_att_find_info_resp_event_rp0 *pr)
{
	uint16_t uuid,handle;
	uint8_t uuid_offset,uuid_size,uuid_short_offset;
	uint8_t i,numDesc,handle_uuid_pair_size;
	static uint16_t gCharUUID=0,gCharStartHandle=0,gCharValueHandle=0,gCharDescriptorHandle=0;
	UNUSED(gCharStartHandle);
	UNUSED(gCharDescriptorHandle);
	UNUSED(gCharUUID);

	if (ancs_context.connection_handle == pr->Connection_Handle)
	{
		/* event data in Attribute_Data_List contains:
		 * 2 bytes handle
		 * 2 or 16 bytes data for UUID
		 */
		if (pr->Format == UUID_TYPE_16)
		{
			uuid_size = 2;
			uuid_offset = 2;
			uuid_short_offset = 0;
			handle_uuid_pair_size = 4;
		}
		if (pr->Format == UUID_TYPE_128)
		{
			uuid_size = 16;
			uuid_offset = 2;
			uuid_short_offset = 12;
			handle_uuid_pair_size = 18;
		}
		UNUSED(uuid_size);

		/* Number of handle uuid pairs */
		numDesc = (pr->Event_Data_Length) / handle_uuid_pair_size;

		for (i = 0; i < numDesc; i++)
		{
			handle = UNPACK_2_BYTE_PARAMETER(&pr->Handle_UUID_Pair[uuid_offset-2]);
			uuid = UNPACK_2_BYTE_PARAMETER(&pr->Handle_UUID_Pair[uuid_offset+uuid_short_offset]);

			/* 1. primary serice handle + primary serice UUID */
			if(uuid == PRIMARY_SERVICE_UUID)
			{
			}/* 1. primary serice handle + primary serice UUID */

			/* 2. char handle + char UUID */
			else if(uuid == CHARACTERISTIC_UUID)
			{
				/* reset UUID & handle */
				gCharUUID = 0;
				gCharStartHandle = 0;
				gCharValueHandle = 0;
				gCharDescriptorHandle = 0;

				gCharStartHandle = handle;
			}/* 2. char handle + char UUID */

			/* 3. char desc handle + char desc UUID */
			else if( (uuid == CHAR_EXTENDED_PROPERTIES_DESCRIPTOR_UUID) /* 0x2900 */
					|| (uuid == CLIENT_CHAR_CONFIG_DESCRIPTOR_UUID) )/* 0x2902 */
			{
				gCharDescriptorHandle = handle;
				if	(gCharValueHandle == ancs_context.ServiceChangedCharValueHdle){
					ancs_context.ServiceChangedCharDescHdle = handle;
				} else if	(gCharValueHandle == ancs_context.ANCSNotificationSourceCharValueHdle){
					ancs_context.ANCSNotificationSourceCharDescHdle = handle;
				} else if	(gCharValueHandle == ancs_context.ANCSDataSourceCharValueHdle){
					ancs_context.ANCSDataSourceCharDescHdle = handle;
				} else if  (gCharValueHandle == ancs_context.ANCSControlPointCharValueHdle){
					ancs_context.ANCSControlPointCharDescHdle = handle;
				}
			}// 3. char desc handle + char desc UUID
			/* 4. char value handle + char UUID */
			else
			{
				gCharUUID = uuid;
				gCharValueHandle = handle;
			}

			uuid_offset += handle_uuid_pair_size;
		}
	}
	else
		APP_DBG_MSG("ACI_ATT_FIND_INFO_RESP_VSEVT_CODE, failed handle not found in connection table !\n");
}

static void GattParseNotification(aci_gatt_notification_event_rp0 *pr)
{
	if (ancs_context.connection_handle == pr->Connection_Handle)
	{
		// 1. Incoming Notification
		if (pr->Attribute_Handle == ancs_context.ANCSNotificationSourceCharValueHdle)
		{
			EventID evID       = (EventID)pr->Attribute_Value[0];
			EventFlags evFlag = (EventFlags)pr->Attribute_Value[1];
			CategoryID catID  = (CategoryID)pr->Attribute_Value[2];
			uint8_t catCount   = pr->Attribute_Value[3];
			uint32_t notifUID   = (uint32_t)(*((uint32_t *)&pr->Attribute_Value[4]));
			ANCS_Notification_Source_Received_event(evID, evFlag, catID, catCount, notifUID);

			// 2. Get More Detailed Information
			if( (evID == EventIDNotificationAdded) )
			{
				for (uint8_t idx=0; idx<MAX_NMB_NOTIFY; idx++)
				{
					if (ancs_context.notifyList[idx].used && ancs_context.notifyList[idx].notifUID == notifUID)
					{
							ancs_context.notifyEntry = idx;
							ancs_context.state = ANCS_GET_NOTIFICATION_ATTRIBUTE;
							ancs_context.notifyShowed = FALSE;
							Ancs_Mgr();
							//APP_DBG_MSG("2. Get More Detailed Information  notifyEntry=%d ==> ANCS_GET_NOTIFICATION_ATTRIBUTE \n",ancs_context.notifyEntry);
							break;
					}
				}
			} else if (evID == EventIDNotificationRemoved) {
				lastNotification.title[0] = 0;
				lastNotification.notifUID = notifUID;
				ancs_context.state = ANCS_NOTIFY_USER;
				Ancs_Mgr();
			}
		}// ANCSNotificationSourceCharValueHdle

