OliverSwift/TFT28-105-STM32WB55/STM32_WPAN/App/ancs_client_app.c
		// 3. Parse Detail Infomations, Perform Notification Action or Get APP Attributes
		if (pr->Attribute_Handle == ancs_context.ANCSDataSourceCharValueHdle)
		{
			CommandID cmdID	= (CommandID)pr->Attribute_Value[0];
			uint32_t notifUID	= (uint32_t)0x00000000;

			uint16_t AttributeLength;
			uint8_t *AttributeList;

			char AppIdentifier[128]={0};
			uint16_t AppIdentifierLength;

			/***********************************************************************************/
			if (cmdID == CommandIDGetNotificationAttributes)
			{
				notifUID = (uint32_t)(*((uint32_t *)&pr->Attribute_Value[1]));
				AttributeLength = pr->Attribute_Value_Length - (1+4);
				AttributeList = (uint8_t *)&pr->Attribute_Value[1+4];

				// 3.1 Parse Detail Infomation of Notification Attribute
				ANCS_Parse_GetNotificationAttr_Resp(notifUID, AttributeLength, AttributeList);
			}
			UNUSED(notifUID);

			if (cmdID == CommandIDGetAppAttributes)
			{
				strcpy(AppIdentifier,(char *)&pr->Attribute_Value[1]);
				AppIdentifierLength = strlen((char *)&pr->Attribute_Value[1]);
				AttributeLength = pr->Attribute_Value_Length - (1+AppIdentifierLength+1);
				AttributeList = (uint8_t *)&pr->Attribute_Value[1+AppIdentifierLength+1];

				// 3.3 Parse Detail Infomation of App Attribute
				ANCS_Parse_GetAppAttr_Resp(cmdID,AttributeLength,AttributeList);
			}

			Ancs_Mgr();
			/***********************************************************************************/
		}/* ANCSDataSourceCharValueHdle */
	}
	else
		APP_DBG_MSG("ACI_GATT_NOTIFICATION_VSEVT_CODE, failed handle not found in connection table !\n");
}

/**
 * @brief  ANCS Event handler
 * @param  Event: Address of the buffer holding the Event
 * @retval Ack: Return whether the Event has been managed or not
 */
static SVCCTL_EvtAckStatus_t ANCS_Client_Event_Handler( void *Event )
{
	SVCCTL_EvtAckStatus_t return_value;
	hci_event_pckt * event_pckt;
	evt_blecore_aci * blecore_evt;
	Connection_Context_t Notification;

	return_value = SVCCTL_EvtAckFlowEnable;
	event_pckt = (hci_event_pckt *) (((hci_uart_pckt*) Event)->data);

	switch (event_pckt->evt)
	{
	case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
	{
		blecore_evt = (evt_blecore_aci*) event_pckt->data;
		switch (blecore_evt->ecode)
		{
		case ACI_ATT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE:
		{
			aci_att_read_by_group_type_resp_event_rp0 *pr = (void*) blecore_evt->data;
			GattParseServices((aci_att_read_by_group_type_resp_event_rp0 *)pr);
		}
		break;
		case ACI_ATT_READ_BY_TYPE_RESP_VSEVT_CODE:
		{
			aci_att_read_by_type_resp_event_rp0 *pr = (void*) blecore_evt->data;
			GattParseChars((aci_att_read_by_type_resp_event_rp0 *)pr);
		}
		break;
		case ACI_ATT_FIND_INFO_RESP_VSEVT_CODE:
		{
			aci_att_find_info_resp_event_rp0 *pr = (void*) blecore_evt->data;
			GattParseDescs((aci_att_find_info_resp_event_rp0 *)pr);
		}
		break; /*ACI_ATT_FIND_INFO_RESP_VSEVT_CODE*/

		case ACI_GATT_DISC_READ_CHAR_BY_UUID_RESP_VSEVT_CODE:
		{
		}
		break;

		case ACI_ATT_FIND_BY_TYPE_VALUE_RESP_VSEVT_CODE:
		{
			aci_att_find_by_type_value_resp_event_rp0 *pr = (void*) blecore_evt->data;
			GattParseServicesByUUID((aci_att_find_by_type_value_resp_event_rp0 *)pr);
		}
		break;

		case ACI_GATT_NOTIFICATION_VSEVT_CODE:
		{
			aci_gatt_notification_event_rp0 *pr = (void*) blecore_evt->data;
			GattParseNotification((aci_gatt_notification_event_rp0 *)pr);
		}
		break;/* end ACI_GATT_NOTIFICATION_VSEVT_CODE */

		case ACI_GATT_ATTRIBUTE_MODIFIED_VSEVT_CODE:
		{
		}/* end ACI_GATT_ATTRIBUTE_MODIFIED_VSEVT_CODE */
		break;

		case ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE:
		{
			aci_att_exchange_mtu_resp_event_rp0 * exchange_mtu_resp;
			exchange_mtu_resp = (aci_att_exchange_mtu_resp_event_rp0 *)blecore_evt->data;
			Notification.Evt_Opcode = ANCS_MTU_EXCHANGE_COMPLETE;
			Notification.connection_handle = exchange_mtu_resp->Connection_Handle;
			ANCS_App_Notification(&Notification);
		}
		break;

		case ACI_GATT_PROC_COMPLETE_VSEVT_CODE:
		{
			aci_gatt_proc_complete_event_rp0 *pr = (void*) blecore_evt->data;
			if(pr->Error_Code != ERR_CMD_SUCCESS)
			{
				APP_DBG_MSG("ACI_GATT_PROC_COMPLETE_VSEVT_CODE - Connection_Handle=0x%04x,Error_Code=0x%02X (0x41: Failed)\n", pr->Connection_Handle,pr->Error_Code);
			}

			if (ancs_context.connection_handle == pr->Connection_Handle)
			{
				gatt_cmd_resp_release(0);
			}
			else
				APP_DBG_MSG("ACI_GATT_PROC_COMPLETE_VSEVT_CODE, failed handle not found in connection table !\n");
		}/*ACI_GATT_PROC_COMPLETE_VSEVT_CODE*/
		break;
		case ACI_GATT_ERROR_RESP_VSEVT_CODE:
		{
			aci_gatt_error_resp_event_rp0 *error_resp= (void*) blecore_evt->data;
			APP_DBG_MSG("ACI_GATT_ERROR_RESP_VSEVT_CODE Connection_Handle=0x%04X Req_Opcode=0x%02X Attribute_Handle=0x%04X Error_Code=0x%02X (0x05: Insufficient authentication,0x0A: Attribute not found)\n",
					error_resp->Connection_Handle,error_resp->Req_Opcode,error_resp->Attribute_Handle,error_resp->Error_Code);
		}/*ACI_GATT_ERROR_RESP_VSEVT_CODE*/
		break;

		case ACI_GATT_PROC_TIMEOUT_VSEVT_CODE:
		{
			aci_gap_terminate(ancs_context.connection_handle, 0);
			APP_DBG_MSG("SERIOUS TIMEOUT\n");
			HAL_Delay(100);
			ANCS_Client_Reset();
		}
		break;

		default:
			APP_DBG_MSG("invalid ecode 0x%04X\n",blecore_evt->ecode);
			return_value = SVCCTL_EvtNotAck;
			break;
		}
	}
	break; /* HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE */

	default:
		return_value = SVCCTL_EvtNotAck;
		break;
	}

	return (return_value);
}/* end BLE_CTRL_Event_Acknowledged_Status_t */

void ANCS_App_Update_Service( )
{
	switch(ancs_context.state)
	{
	case ANCS_MTU_UPDATE:
		GattProcReq(GATT_PROC_MTU_UPDATE);
		break;

	case ANCS_DISCOVER_ANCS_SERVICE:
		/* GattProcReq(GATT_PROC_MTU_UPDATE); */ /* enable it if you want to set ATT_MTU */
		GattProcReq(GATT_PROC_DISC_ANCS_SERVICE);
		GattProcReq(GATT_PROC_DISC_ALL_PRIMARY_SERVICES);
		GattProcReq(GATT_PROC_DISC_ALL_CHARS);
		GattProcReq(GATT_PROC_DISC_ALL_DESCS);

		if ( (ancs_context.ANCSServiceStartHandle != 0x0000) && (ancs_context.ANCSServiceEndHandle != 0x0000) )
		{
			APP_BLE_Slave_Security_Request();
		}

		GattProcReq(GATT_PROC_ENABLE_ALL_NOTIFICATIONS);
		break;


	case ANCS_GET_NOTIFICATION_ATTRIBUTE:
		AncsProcReq(ANCS_PROC_GET_NOTIFICATION_ATTRIBUTE);
		break;

	case ANCS_GET_APP_ATTRIBUTE:
		AncsProcReq(ANCS_PROC_GET_APP_ATTRIBUTE);
		break;

