OliverSwift/TFT28-105-STM32WB55/STM32_WPAN/App/ancs_client_app.c
	case ANCS_PERFORM_NOTIFICATION_ACTION:
		AncsProcReq(ANCS_PROC_PERFORM_NOTIFICATION_ACTION);
		break;

	case ANCS_NOTIFY_USER:
		TFTShowNotification(&lastNotification);
		break;

	case ANCS_IDLE:
		break;

	default:
		APP_DBG_MSG("invalid ancs_context.state=%d \n",ancs_context.state);
		break;
	}
}

static void GattProcReq(GattProcId_t GattProcId)
{
	tBleStatus result = BLE_STATUS_SUCCESS;

	switch (GattProcId)
	{
	case GATT_PROC_MTU_UPDATE:
	{
		ancs_context.state = ANCS_SET_DATA_LENGTH;
		result = hci_le_set_data_length(ancs_context.connection_handle,CFG_BLE_MAX_ATT_MTU,CFG_BLE_MAX_ATT_MTU_TX_TIME);
		if (result == BLE_STATUS_SUCCESS)
		{
			ancs_context.state = ANCS_MTU_UPDATE;
			result = aci_gatt_exchange_config(ancs_context.connection_handle);
			gatt_cmd_resp_wait(GATT_DEFAULT_TIMEOUT);
			if (result != BLE_STATUS_SUCCESS)
			{
				APP_DBG_MSG("aci_gatt_exchange_config cmd KO result=0x%02x \n",result);
			}
		}
	}
	break; /* GATT_PROC_MTU_UPDATE */

	case GATT_PROC_DISC_ANCS_SERVICE:
	{
		ancs_context.state = ANCS_DISCOVER_ANCS_SERVICE;
		/* discover ancs service for discover notification source / data source / control point characteristic */
		UUID_t ancs_service_uuid;
		COPY_ANCS_SERVICE_UUID(ancs_service_uuid.UUID_128);
		result = aci_gatt_disc_primary_service_by_uuid(ancs_context.connection_handle,UUID_TYPE_128,(UUID_t *)&ancs_service_uuid);
		if (result != BLE_STATUS_SUCCESS)
		{
			APP_DBG_MSG("GATT_PROC_DISC_ANCS_SERVICE aci_gatt_disc_primary_service_by_uuid cmd NOK status =0x%02X \n",result);
		}

		gatt_cmd_resp_wait(GATT_DEFAULT_TIMEOUT);
		if ( (ancs_context.ANCSServiceStartHandle == 0x0000) && (ancs_context.ANCSServiceEndHandle == 0x0000) )
		{
			APP_DBG_MSG("GATT_PROC_DISC_ANCS_SERVICE ANCS Service is NOT found !!! ==> connected to Android Phone/Pad \n");
		}
		else if ( (ancs_context.ANCSServiceStartHandle != 0x0000) && (ancs_context.ANCSServiceEndHandle != 0x0000) )
		{
			APP_DBG_MSG("GATT_PROC_DISC_ANCS_SERVICE ANCS Service [0x%04X - 0x%04X] is found !!! ==> connected to iOS Phone/Pad \n",ancs_context.ANCSServiceStartHandle,ancs_context.ANCSServiceEndHandle);
		}
	}
	break; /* GATT_PROC_DISC_ANCS_SERVICE */

	case GATT_PROC_DISC_ALL_PRIMARY_SERVICES:
	{
		ancs_context.state = ANCS_DISCOVER_ALL_SERVICES;
		/* discover all services */
		result = aci_gatt_disc_all_primary_services(ancs_context.connection_handle);
		gatt_cmd_resp_wait(GATT_DEFAULT_TIMEOUT);
		if (result != BLE_STATUS_SUCCESS)
		{
			APP_DBG_MSG("GATT_PROC_DISC_ALL_PRIMARY_SERVICES aci_gatt_disc_all_primary_services cmd NOK status =0x%02X \n",result);
		}

		if ( (ancs_context.ANCSServiceStartHandle == 0x0000) && (ancs_context.ANCSServiceEndHandle == 0x0000) )
		{
			APP_DBG_MSG("GATT_PROC_DISC_ALL_PRIMARY_SERVICES ANCS Service is NOT found !!! \n");
		}
		else if ( (ancs_context.ANCSServiceStartHandle != 0x0000) && (ancs_context.ANCSServiceEndHandle != 0x0000) )
		{
			APP_DBG_MSG("GATT_PROC_DISC_ALL_PRIMARY_SERVICES ANCS Service [0x%04X - 0x%04X] is found !!! \n",ancs_context.ANCSServiceStartHandle,ancs_context.ANCSServiceEndHandle);
			APP_DBG_MSG("GATT_PROC_DISC_ALL_PRIMARY_SERVICES GATT Service [0x%04X - 0x%04X] is found !!! \n",ancs_context.GATTServiceStartHandle,ancs_context.GATTServiceEndHandle);
		}
	}
	break; /* GATT_PROC_DISC_ALL_PRIMARY_SERVICES */

	case GATT_PROC_DISC_ALL_CHARS:
	{
		ancs_context.state = ANCS_DISCOVER_ALL_CHARS;

		result = aci_gatt_disc_all_char_of_service(
				ancs_context.connection_handle,
				ancs_context.ALLServiceStartHandle,
				ancs_context.ALLServiceEndHandle);
		gatt_cmd_resp_wait(GATT_DEFAULT_TIMEOUT);
		if (result != BLE_STATUS_SUCCESS)
		{
			APP_DBG_MSG("ALL characteristics discovery Failed \n");
		}
	}
	break; /* GATT_PROC_DISC_ALL_CHARS */

	case GATT_PROC_DISC_ALL_DESCS:
	{
		ancs_context.state = ANCS_DISCOVER_ALL_CHAR_DESCS;
		result = aci_gatt_disc_all_char_desc(
				ancs_context.connection_handle,
				ancs_context.ALLServiceStartHandle,
				ancs_context.ALLServiceEndHandle);
		gatt_cmd_resp_wait(GATT_DEFAULT_TIMEOUT);
		if (result != BLE_STATUS_SUCCESS)
		{
			APP_DBG_MSG("All characteristic descriptors discovery Failed \n");
		}
	}
	break; /* GATT_PROC_DISC_ALL_DESCS */

	case GATT_PROC_ENABLE_ALL_NOTIFICATIONS:
	{
		uint16_t enable = 0x0001;

		if(ancs_context.ANCSDataSourceCharDescHdle != 0x0000)
		{
			ancs_context.state = ANCS_ENABLE_NOTIFICATION_DATA_SOURCE_DESC;
			result = aci_gatt_write_char_desc(
					ancs_context.connection_handle,
					ancs_context.ANCSDataSourceCharDescHdle,
					2,
					(uint8_t *) &enable);
			gatt_cmd_resp_wait(GATT_DEFAULT_TIMEOUT);
			if (result != BLE_STATUS_SUCCESS)
			{
				APP_DBG_MSG("ANCSDataSourceCharDescHdle=0x%04X notification enabled Failed BLE_STATUS_NOT_ALLOWED=0x%02x result=0x%02X\n",
						ancs_context.ANCSDataSourceCharDescHdle,BLE_STATUS_NOT_ALLOWED,result);
			}
		}

		if(ancs_context.ANCSNotificationSourceCharDescHdle != 0x0000)
		{
			ancs_context.state = ANCS_ENABLE_NOTIFICATION_NOTIFICATION_SOURCE_DESC;
			result = aci_gatt_write_char_desc(
					ancs_context.connection_handle,
					ancs_context.ANCSNotificationSourceCharDescHdle,
					2,
					(uint8_t *) &enable);
			gatt_cmd_resp_wait(GATT_DEFAULT_TIMEOUT);
			if (result != BLE_STATUS_SUCCESS)
			{
				APP_DBG_MSG("ANCSNotificationSourceCharDescHdle notification enabled Failed result=0x%02X\n",result);
			}
		}
	}
	break; /* GATT_PROC_ENABLE_ALL_NOTIFICATIONS */

	default:
		break;
	}
}

static void AncsProcReq(AncsProcId_t AncsProcId)
{
	switch (AncsProcId)
	{

	case ANCS_PROC_GET_NOTIFICATION_ATTRIBUTE:
	{
		ancs_context.state = ANCS_GET_NOTIFICATION_ATTRIBUTE;
		if ( (ancs_context.notifyEntry == INVALID_NOTIFY_ENTRY) || (ancs_context.notifyEntry >= MAX_NMB_NOTIFY) )
		{
			APP_DBG_MSG("ANCS_GET_NOTIFICATION_ATTRIBUTE INVALID_NOTIFY_ENTRY %d \n",ancs_context.notifyEntry);
			break;
		}

		notificationAttr_type attr;
		attr.UID = ancs_context.notifyList[ancs_context.notifyEntry].notifUID;
		attr.appID_flag = FALSE;
		attr.title_flag = TRUE;
		attr.title_max_size = MAX_DATA_LEN;
		attr.subtitle_flag = TRUE;
		attr.subtitle_max_size = MAX_DATA_LEN;
		attr.message_flag = TRUE;
		attr.message_max_size = MAX_DATA_LEN;
		attr.messageSize_flag = TRUE;
		attr.date_flag = FALSE;
		attr.positiveAction_flag = FALSE;
		attr.negativeAction_flag = FALSE;

		ANCS_Cmd_GetNotificationAttr(attr);
	}
	break; /* ANCS_PROC_GET_NOTIFICATION_ATTRIBUTE */

	case ANCS_PROC_GET_APP_ATTRIBUTE:
	{
		ancs_context.state = ANCS_GET_APP_ATTRIBUTE;
		ANCS_Cmd_GetAppAttr(ancs_context.AppIdentifierLength, (char*)ancs_context.AppIdentifier);
	}
	break; /* ANCS_PROC_GET_APP_ATTRIBUTE */

	case ANCS_PROC_PERFORM_NOTIFICATION_ACTION:
	{
		ancs_context.state = ANCS_PERFORM_NOTIFICATION_ACTION;
		ANCS_Cmd_PerformNotificationAction(lastNotification.notifUID, lastNotification.actID);
	}
	break; /* ANCS_PROC_PERFORM_NOTIFICATION_ACTION */

	default:
		break;
	}
}

void ANCS_App_Notification( Connection_Context_t *pNotification )
{
	switch (pNotification->Evt_Opcode)
	{
	case ANCS_CONNECTED:
	{
		ancs_context.connection_handle = pNotification->connection_handle; /* register */
		ancs_context.state = ANCS_DISCOVER_ANCS_SERVICE;
		APP_DBG_MSG("ANCS_CONNECTED ==> ANCS_DISCOVER_ANCS_SERVICE \n");
		Ancs_Mgr();

		// Light up green led
		HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_SET);
	}
	break;

	case ANCS_DISCONNECTING:
	{
		APP_DBG_MSG("ANCS_DISCONNECTING \n");
		ancs_context.state = ANCS_DISCONNECTING;
		ANCS_Client_Reset();
	}
	break;

	case ANCS_DISCONN_COMPLETE:
	{
		APP_DBG_MSG("ANCS_DISCONN_COMPLETE \n");
		ancs_context.state = ANCS_DISCONN_COMPLETE;
		ANCS_Client_Reset();

		// Tell application to clear display
		TFTShowNotification(NULL);

		// Switch off green led
		HAL_GPIO_WritePin(LD2_GPIO_Port, LD2_Pin, GPIO_PIN_RESET);
	}
	break;

	case ANCS_MTU_UPDATE:
	{
		APP_DBG_MSG("ANCS_MTU_UPDATE \n");
		ancs_context.state = ANCS_MTU_UPDATE;
		Ancs_Mgr();
	}
	break;

	case ANCS_MTU_EXCHANGE_COMPLETE:
	{
		APP_DBG_MSG("ANCS_MTU_EXCHANGE_COMPLETE \n");
		if(ancs_context.state == ANCS_MTU_UPDATE)
			gatt_cmd_resp_release(0);

		ancs_context.state = ANCS_MTU_EXCHANGE_COMPLETE;
	}
	break;

	case ANCS_DISCOVER_ANCS_SERVICE:
	{
		APP_DBG_MSG("ANCS_DISCOVER_ANCS_SERVICE \n");
		ancs_context.state = ANCS_DISCOVER_ANCS_SERVICE;
		Ancs_Mgr();
	}
	break;

	case ANCS_PERFORM_NOTIFICATION_ACTION:
	{
		ancs_context.state = ANCS_PERFORM_NOTIFICATION_ACTION;
		Ancs_Mgr();
	}
	break;

	default:
		break;

	}
	return;
}





/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
